Revit 2027 API
TriangulatedShellComponent.GetTriangle Method
 Returns the triangle corresponding to the given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TriangleInShellComponent GetTriangle(
	int triangleIndex
)
Public Function GetTriangle (
	triangleIndex As Integer
) As TriangleInShellComponent
public:
TriangleInShellComponent^ GetTriangle(
	int triangleIndex
)
member GetTriangle :
        triangleIndex : int -> TriangleInShellComponent
Parameters
triangleIndex Int32
 The index of the triangle (between 0 and TriangleCount-1, inclusive).
Return Value
TriangleInShellComponent
 The triangle.
Exceptions
Exception | Condition
ArgumentException |  triangleIndex is out of range.
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace